{
    "jobs": [{
        "title": "Tech Architecture Delivery Specialist",
        "company": "Accenture",
        "about": "As tech architect in financial services, I participate in all parts of Agile SDLC; story pointing and refinement sessions, implementation of code, unit and integration testing, effective code documentation using Github, as well as deployment and maintenance using Devops methodologies and multiple environments using technology such as Jenkins.",
        "link": "https://www.accenture.com/",
        "year": "September 2017 - Present",
        "description": ["Serves as architect on $6,000,000 application on project worth $100,000,000", "Enables end-users to select a variety of insurance products and features", "Assists with coding of LESS, HTML, and JavaScript in AngularJS SPA", "Participates in all parts of Agile SDLC", "Conducts unit and integration testing", "Documents code effectively using subversioning", "Deploys and maintain code using Devops methodology", "Aids online business processes and direct sales on a strategic level.", "Assists with marketing execution, sales execution, and small business owner (SBO) acquisition", "Enables end-users to select a variety of insurance products and features"]
    },{
        "title": "Software Engineer",
        "company": "Booz Allen Hamilton",
        "about": "In this role I helped with the tranformation migration for a large federal agency assisting with the publishing model, style guides, UX research, and front end development",
        "link": "https://www.boozallen.com/",
        "year": "06/16 - 9/17",
        "description": ["Serves as Subject Matter Expert for responsive HTML and CSS", "Updates production code for client", "Creates technical documentation for client and consultants on project", "Perform unit testing in EITE environments", "Aid with style guide requirement creation and review code for compliance", "Leads team integration of Slack", "Assists with transformation migration of largest federal website in history"]
    }, {
        "title": "Freelance Developer",
        "company": "International Traveler Assurance, Phi Beta Sigma",
        "about": "I spent a year doing freelance work part time and then full time. This gave me more time to grow as a self guided developer that needs to address client needs. During this time I was able to experiment and use modern technologies such as Angular and Ruby on Rails.",
        "link": "",
        "year": "06/15 – 06/16",
        "description": ["Created custom HTML, CSS, and JavaScript for clients", "Generated database of alumni brothers stored in a JSON file", "Developed searchable application of brothers using MVC framework/Angular application pulling from JSON file"]
    }, {
        "title": "Manager of Web Technologies (Contract)",
        "company": "Hearing Loss Association of America",
        "about": "This was a brief contract working for a high traffic nonprofit website. Here I created various digital solutions for end users including photoshop images, email campaings, and web pages.",
        "link": "https://www.hearingloss.org/",
        "year": "11/15 – 12/15",
        "description": ["Created and updated pages for website with over 500,000 annual visitors", "Created several html email campaigns messaging thousands of members and constituents", "Utilized Adobe Photoshop to create new slide for Association homepage"]
    }, {
        "title": "Resources Coordinator",
        "company": "American University Washington College of Law",
        "about": "Working in the AUWCL Office of Professional Development I worked with several counselors to update and revamp pages for the department, this included UX consulting and front end editing. A key deliverable for this position was a new user friendly landing page and navigation for end users.",
        "link": "https://www.wcl.american.edu/career/",
        "year": "05/14 – 11/15",
        "description": ["Designed front-end content for Office of Career & Professional Development", "Assisted internal stakeholders with modernization of pages by improving UX, IA, and content design decisions", "Drafted messaging content and pages for highly public office campaigns"]
    }],
    "projects" : [{
      "title": "Chat App",
      "description": "An application that allows multiple users to create different chat rooms inside the application and engage in real time communication.",
      "software": ["NodeJS", "Socket.io", "jQuery", "mustache.js", "Mocha"],
      "link": "https://obscure-sea-17696.herokuapp.com/",
      "image": "ChatApp"
    },{
      "title": "Weather App",
      "description": "An application that that takes a location from the user, submits the information to weather api, and returns the current weather to the user.",
      "software": ["NodeJS", "React", "SCSS"],
      "link": "https://limitless-wildwood-39373.herokuapp.com/",
      "image": "WeatherApp2"
    },{
      "title": "3D Gallery",
      "description": "A 3D photo gallery that allows users to cycle through galleries in a 3D carousel.",
      "software": ["jQuery", "CSS"],
      "link": "http://kb3itsolutions.com/LL/chnnl1914.html",
      "image": "3DGallery"
    },{
      "title": "Link Shortener",
      "description": "A web app that takes a link provided by the user and creates truncated link they can use to paste to guide people to the original link.",
      "software": ["NodeJS", "React", "Meteor"],
      "link": "https://short-link-brown.herokuapp.com/",
      "image": "ShortLink"
    }, {
      "title": "PSD Conversion",
      "description": "A web page created to create a functional page from a PSD.",
      "software": ["HTML", "CSS", "jQuery"],
      "link": "http://kb3itsolutions.com/portfolio/aspph.html",
      "image": "PSDConversion"
    }, {
      "title": "Online Calculator",
      "description": "A jquery calculator",
      "software": ["HTML", "CSS", "jQuery"],
      "link": "http://kb3itsolutions.com/jQueryCalc.html",
      "image": "OnlineCalc"
    }
    ],
    "skills": [{
      "skill": "Front End Development",
      "list": ["Javascript", "React", "Angular", "jQuery", "HTML", "CSS", "Meteor", "SASS", "Materialize"]
    }, {
      "skill": "Back End Development",
      "list": ["NodeJS", "Ruby on Rails", "Meteor", "Express", "Connect", "NPM", "Yarn"]
    }, {
      "skill": "Testing",
      "list": ["Mocha", "Karma", "RSpec"]
    }, {
      "skill": "Databases",
      "list": ["SQLite", "MongoDB", "ActiveRecord", "Noah", "Datatel", "Symplicity"]
    }, {
      "skill": "Content Management Systems",
      "list": ["WordPress", "Drupal"]
    }, {
      "skill": "Graphic Design",
      "list": ["Photoshop", "Illustrator", "Adobe XD"]
    }],
    "feedback": [{
      "role": "UX Designer",
      "organization": "Booz Allen Hamiltion",
      "comment": "Kendall has been able to quickly contribute and raise issues pertinent to other work streams due to his technical knowledge and has skillfully coordinated though his project leads to present solutions to the client. Kendall is able to frame his solutions within the technical understanding of the client, a valuable skill when interacting with clients and non-technical associates. Kendall is passionate about providing value and tangible solutions to our client’s problems."
    }, {
      "role": "Project Manager",
      "organization": "Booz Allen Hamiltion",
      "comment": "Kendall has leveraged his front-end development subject matter expertise, particularly in Bootstrap CSS and HTML, to take the lead in investigating and recommending solutions to fix these issues"
    }, {
      "role": "Project Manager",
      "organization": "Booz Allen Hamiltion",
      "comment": "Kendall has been relied on to raise and report issues that impact the quality of the User Interface and ensuring it aligns the style guide.  He has addressed issues raised by the client in a knowledgeable manner. As the content team, has progressed in their cleanup of the migrated content, encountering unexpected user interface issues and behaviors, Kendall has been the point person on investigate these issues."
    }, {
      "role": "Project Manager",
      "organization": "Booz Allen Hamiltion",
      "comment": "Applying his thorough understanding of browser debugging tools he could identify quick fixes or escalating issues that impact multiple pages.  Through these activities and his ability to communicate issues and solutions effectively, Kendall has built a reputation as subject matter expert who can facilitate and lead discussions on front end development problems and solutions. He has been given increasing responsibility in this domain from assisting the UX work stream with code insight when developing style guides to leading discussions with the client around ways to fix site wide problems that can affect deliverable deadlines."
    }]
}
